In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

In [19]:
customers = pd.read_csv(r'D:\Customer Spend Risk Analysis\Data\Bronze\customers__bronze.csv')
merchants = pd.read_csv(r'D:\Customer Spend Risk Analysis\Data\Bronze\merchants_Bronze.csv')
transactions = pd.read_csv(r'D:\Customer Spend Risk Analysis\Data\Bronze\transactions_bronze.csv')

In [20]:
transactions.isnull().sum()

txn_id           0
txn_date         0
customer_id      0
amount         251
currency         0
merchant         0
city           152
device         210
dtype: int64

In [22]:
transactions['currency'].value_counts()

currency
INR     133
USD     128
usd     120
INR     119
Name: count, dtype: int64

In [24]:

transactions['amount'].describe()

count       249.000000
mean      98073.465863
std       61637.698682
min       -3863.000000
25%       44757.000000
50%       90841.000000
75%      157825.000000
max      199541.000000
Name: amount, dtype: float64

In [25]:
merchants.head()

   merchant   category  risk_score
0    Amazon        NaN        0.12
1  Flipkart        NaN        0.57
2   Walmart  Ecommerce        0.17
3    Myntra        NaN        0.21
4    Swiggy        NaN        0.25

In [26]:
merchants.isnull().sum()

merchant      0
category      4
risk_score    0
dtype: int64

In [27]:
merchants['risk_score'].describe()

count    7.000000
mean     0.311429
std      0.167076
min      0.120000
25%      0.190000
50%      0.250000
75%      0.430000
max      0.570000
Name: risk_score, dtype: float64

In [28]:
customers.head()

  customer_id        name   age  annual_income  segment      city
0        C001  Customer_1  58.0            NaN      VIP     Delhi
1        C002  Customer_2  32.0            NaN  PREMIUM       NaN
2        C003  Customer_3   NaN        1084834  Premium    Mumbai
3        C004  Customer_4  31.0            NaN  Premium       NaN
4        C005  Customer_5   NaN  not available  Regular  New York

In [ ]:
customers.isnull().sum()

txn_id           0
txn_date         0
customer_id      0
amount         251
currency         0
merchant         0
city           152
device         210
dtype: int64

In [ ]:
customers['amount'].describe()

count       249.000000
mean      98073.465863
std       61637.698682
min       -3863.000000
25%       44757.000000
50%       90841.000000
75%      157825.000000
max      199541.000000
Name: amount, dtype: float64